---
kind: property
id: P:Autodesk.Revit.DB.BoundingBoxXYZ.IsSet
zh: 包围盒
source: html/4c7c9482-953b-8685-679f-4d333ac15a7e.htm
---
# Autodesk.Revit.DB.BoundingBoxXYZ.IsSet Property

**中文**: 包围盒

Indicates whether the bounding box is set.

## Syntax (C#)
```csharp
public bool IsSet { get; }
```

## Remarks
Bounding box is considered set when it contains at least one point and "Enabled" is set to "true".